chartref/mongodbcluster1/f/rc1000-op1000/tc8/run1.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27021 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadf -p recordcount=1000 -threads 8 -p operationcount=1000
mongo client connection created with mongodb://172.16.13.26:27021
[OVERALL], RunTime(ms), 839
[OVERALL], Throughput(ops/sec), 1191.8951132300358
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 12
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.430274135876043
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 1.430274135876043
[READ], Operations, 1000
[READ], AverageLatency(us), 2635.507
[READ], MinLatency(us), 1284
[READ], MaxLatency(us), 42687
[READ], 95thPercentileLatency(us), 3751
[READ], 99thPercentileLatency(us), 7507
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 488
[READ-MODIFY-WRITE], AverageLatency(us), 5280.944672131148
[READ-MODIFY-WRITE], MinLatency(us), 2762
[READ-MODIFY-WRITE], MaxLatency(us), 60703
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 7763
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 13623
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 379.25
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 3027
[CLEANUP], 95thPercentileLatency(us), 3027
[CLEANUP], 99thPercentileLatency(us), 3027
[UPDATE], Operations, 488
[UPDATE], AverageLatency(us), 2414.340163934426
[UPDATE], MinLatency(us), 1205
[UPDATE], MaxLatency(us), 11359
[UPDATE], 95thPercentileLatency(us), 4443
[UPDATE], 99thPercentileLatency(us), 9279
[UPDATE], Return=OK, 488